Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.GetLabel Method
Overload List
Name | Description
GetLabel()
 Gets the label of the user property. Labels are translated when translation is available.
GetLabel(Boolean)
 Gets the label of the user property.
Top
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace